### Learning Pandas (4)
#### 13. splitting a string into multiple Columns

In [9]:
import pandas as pd 
df = df = pd.DataFrame({"name": ['maaz khan','ammar ayaz','kashif haider','atif shah'],
                   "location": ['malakand, kpk','nowshehra, kpk','kohat, kpk ', 'karak, kpk']})
df

            name        location
0      maaz khan   malakand, kpk
1     ammar ayaz  nowshehra, kpk
2  kashif haider     kohat, kpk
3      atif shah      karak, kpk

In [10]:
#splitting a column into two columns
df['name'].str.split(' ', expand=True)

        0       1
0    maaz    khan
1   ammar    ayaz
2  kashif  haider
3    atif    shah

In [11]:
#adding these split into new Columns
df[['first Name', '2nd name']] = df.name.str.split(' ',expand=True)
df

            name        location first Name 2nd name
0      maaz khan   malakand, kpk       maaz     khan
1     ammar ayaz  nowshehra, kpk      ammar     ayaz
2  kashif haider     kohat, kpk      kashif   haider
3      atif shah      karak, kpk       atif     shah

In [12]:
df[['city','province']] = df.location.str.split(', ',expand=True)
df

            name        location first Name 2nd name       city province
0      maaz khan   malakand, kpk       maaz     khan   malakand      kpk
1     ammar ayaz  nowshehra, kpk      ammar     ayaz  nowshehra      kpk
2  kashif haider     kohat, kpk      kashif   haider      kohat     kpk
3      atif shah      karak, kpk       atif     shah      karak      kpk

In [13]:
#refine data manupulation
df[['name', 'location', 'city', 'province']]

            name        location       city province
0      maaz khan   malakand, kpk   malakand      kpk
1     ammar ayaz  nowshehra, kpk  nowshehra      kpk
2  kashif haider     kohat, kpk       kohat     kpk
3      atif shah      karak, kpk      karak      kpk

#### 14. Aggregate by multiple groups/function

In [14]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [17]:
#this shows no. of catagories 
df.groupby('sex').count()
df.groupby('who').count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [18]:
len(df.who)

891

In [19]:
len(df.groupby('who'))

3

In [20]:
df.groupby(['sex','who','pclass']).count()

                     survived  age  sibsp  parch  fare  embarked  class  \
sex    who   pclass
female child 1              3    3      3      3     3         3      3
             2             10   10     10     10    10        10     10
             3             30   30     30     30    30        30     30
       woman 1             91   82     91     91    91        89     91
             2             66   64     66     66    66        66     66
             3            114   72    114    114   114       114    114
male   child 1              3    3      3      3     3         3      3
             2              9    9      9      9     9         9      9
             3             28   28     28     28    28        28     28
       man   1            119   98    119    119   119       119    119
             2             99   90     99     99    99        99     99
             3            319  225    319    319   319       319    319

                     adult_male  deck  embark_town  alive  alone
sex    who   pclass
female child 1                3     3            3      3      3
             2               10     1           10     10     10
             3               30     2           30     30     30
       woman 1               91    78           89     91     91
             2               66     9           66     66     66
             3              114     4          114    114    114
male   child 1                3     3            3      3      3
             2                9     3            9      9      9
             3               28     1           28     28     28
       man   1              119    91          119    119    119
             2               99     3           99     99     99
             3              319     5          319    319    319

In [22]:
# selecting specific columns
df[['sex','age','pclass']].head()

      sex   age  pclass
0    male  22.0       3
1  female  38.0       1
2  female  26.0       3
3  female  35.0       1
4    male  35.0       3

In [23]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [24]:
# for selecting specific no. of rows
df.describe().loc[['min','25%','50%', '75%', 'max']]
# Or 
df.describe().loc['min' : 'max']

     survived  pclass     age  sibsp  parch      fare
min       0.0     1.0   0.420    0.0    0.0    0.0000
25%       0.0     2.0  20.125    0.0    0.0    7.9104
50%       0.0     3.0  28.000    0.0    0.0   14.4542
75%       1.0     3.0  38.000    1.0    0.0   31.0000
max       1.0     3.0  80.000    8.0    6.0  512.3292

In [25]:
#to select specific rows and specific columns
df.describe().loc['min' : 'max', ['survived', 'age'] ]
df.describe().loc['min' : 'max', 'survived' : 'parch' ]

     survived  pclass     age  sibsp  parch
min       0.0     1.0   0.420    0.0    0.0
25%       0.0     2.0  20.125    0.0    0.0
50%       0.0     3.0  28.000    0.0    0.0
75%       1.0     3.0  38.000    1.0    0.0
max       1.0     3.0  80.000    8.0    6.0